# Series

In [1]:
import pandas as pd

시리즈 : 컬럼 + 인덱스 형식으로 저장, 관리
* 컬럼 : 1차원 데이터의 모음 - 1개 컬럼
* 컬럼들 > 데이터프레임

데이터 프레임 : 컬럼들 + 인덱스, 엑셀 표(테이블) 유사한 형태

In [2]:
s1 = pd.Series([10, 20, 30, 40, 50])

In [3]:
s1[0:2]

0    10
1    20
dtype: int64

In [4]:
col_list = ['A', 'B', 'C', 'D', 'E']
data = [10, 20, 30, 40, 50]
s2 = pd.Series(data, index=col_list)

In [ ]:
s2['A':'C']    #슬라이싱, 인덱스이름기반 추출

A    10
B    20
C    30
dtype: int64

In [9]:
dict_data = {'A':10, 'B':20, 'C':30, 'D':40, 'E':50}
s3 = pd.Series(dict_data)
s3

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [10]:
s3.info()

<class 'pandas.core.series.Series'>
Index: 5 entries, A to E
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 252.0+ bytes

In [12]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776
서울    9776
부산    2729
dtype: int64

In [ ]:
population['강원'] = 1450      # 행 추가
population

서울    9776
부산    2729
인천    1566
대구    3158
강원    1450
dtype: int64

# 데이터 프레임 DataFrame

In [54]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [55]:
# 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'], index=['row1', 'row2', 'row3'])
print(df)

      A  B  C
row1  1  2  3
row2  4  5  6
row3  7  8  9

In [56]:
import numpy as np
import pandas as pd

# 2차원 넘파이 어레이 생성
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])

arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [57]:
# 데이터프레임 생성
df = pd.DataFrame(arr, columns=['A', 'B', 'C'], index=['row1', 'row2', 'row3'])
print(df)

      A  B  C
row1  1  2  3
row2  4  5  6
row3  7  8  9

In [58]:
# 시리즈 생성
names = pd.Series(['김철수', '이영희', '박민수'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])

names, ages, scores

(0    김철수
 1    이영희
 2    박민수
 dtype: object,
 0    25
 1    28
 2    22
 dtype: int64,
 0    85
 1    92
 2    78
 dtype: int64)

In [59]:
# 시리즈를 딕셔너리로 묶어 데이터프레임 생성
df = pd.DataFrame({
    '이름': names,
    '나이': ages,
    '점수': scores
})
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [60]:
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 78]
}
df = pd.DataFrame(data)
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [1]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [62]:
# 처음 5개 행 보기
print("=== head() ===")
print(df.head())

=== head() ===
    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

In [63]:

# 마지막 3개 행 보기
print("\n=== tail(3) ===")
print(df.tail(3))

=== tail(3) ===
    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [64]:

df.describe()

              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [65]:
#미리보기
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [2]:
# 행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
print(df.index)

# columns 속성으로 모든 열 이름 한번에 변경
df.columns = ['name', 'age', 'score']

# 열 순서는 그대로 유지되며, 새로운 이름이 순서대로 적용됨
print(df.columns)
df

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')
Index(['name', 'age', 'score'], dtype='object')

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [71]:

#df.rename(columns={'name':'이름'}, inplace=True) #before:after
# inplace >> 새로운 df 복사본에서 확인하는 방법이 안전.
df1 = df.rename(columns={'이름': 'name', '나이': 'age', '점수': 'score'})
df1 = df.rename(index={"A":"a", "B": "b"})
df1

  name  age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [ ]:
# inplace=True를 쓰면 원본 DataFrame 자체가 바로 바뀝니다.
# (반대로 inplace=False면 새 DataFrame을 반환)

import pandas as pd

df = pd.DataFrame({
    "name": ["A", "B"],
    "score": [90, 80],
    "dept": ["HR", "IT"]
})

print("변경 전:\n", df)

df.rename(columns={"score": "점수", "dept": "부서"}, inplace=True)

print("\n변경 후(원본 df가 바뀜):\n", df)

변경 전:
   name  score dept
0    A     90   HR
1    B     80   IT

변경 후(원본 df가 바뀜):
   name  점수  부서
0    A  90  HR
1    B  80  IT

# 인덱싱
[행,열] 인덱싱

* iloc[] 행기반 인덱싱 >>> [행,열]

* loc[] 이름기반(위치) 인덱싱 >>> [행이름,열이름]

* : >> start:end 까지 슬라이싱

* loc[행이름:행이름]

* iloc[행번호:행번호] >>> end 행번호는 -1 까지

In [3]:
#열 선택 > 시리즈 추출
print(df['name'])

A    김철수
B    이영희
C    박민수
D    정수진
E    최영호
F    한미래
G    윤지원
Name: name, dtype: object

In [4]:
# iloc로 위치 기반 행 선택
print(df.iloc[0])     # 첫 번째 행
print(df.iloc[1:4])   # 2~4번째 행

name     김철수
age       25
score     85
Name: A, dtype: object
  name  age  score
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95

In [5]:
# loc로 라벨 기반 행 선택
print(df.loc['A'])    # 인덱스가 'A'인 행

name     김철수
age       25
score     85
Name: A, dtype: object

In [6]:
# 조건을 사용한 행 선택
print(df[df['age'] > 25])  # 나이가 25보다 큰 행들

  name  age  score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91

In [8]:
#df1[['name', 'age']]
df.loc[ : , ['name', 'age']   ]  # loc[행, 열]

  name  age
A  김철수   25
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24
G  윤지원   29

In [9]:
df.iloc[0:3, 0:2] #행번호, 열, :은 start:end(-1)

  name  age
A  김철수   25
B  이영희   28
C  박민수   22

# 연습문제

In [11]:
#모든 행에서 이름 열만 선택하세요.
df.loc[ : , 'name']

A    김철수
B    이영희
C    박민수
D    정수진
E    최영호
F    한미래
G    윤지원
Name: name, dtype: object

In [12]:
# 모든 행에서 이름과 score 열을 선택하세요
df.loc[ : , ['name', 'score'] ]

  name  score
A  김철수     85
B  이영희     92
C  박민수     78
D  정수진     95
E  최영호     88
F  한미래     73
G  윤지원     91

In [13]:
# 인덱스 C행의 모든 데이터를 선택하세요.
df.loc['C']

name     박민수
age       22
score     78
Name: C, dtype: object

In [15]:
# 인덱스 D행의 age 값만 선택하세요.
df.loc['D', 'age']

np.int64(31)

In [16]:
# 인덱스 B부터 E까지의 모든 행을 선택하세요.
df.loc['B':'E']

  name  age  score
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

In [17]:
# 인덱스 C부터 F까지의 이름과 age 열만 선택하세요.
df.loc['C':'F', ['name', 'age']]

  name  age
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [19]:
# 인덱스 A부터 G까지에서 score 열만 선택하세요.
df.loc['A':'G', 'score']

A    85
B    92
C    78
D    95
E    88
F    73
G    91
Name: score, dtype: int64

In [20]:
# age가 27 이상인 행만 선택하세요.
df.loc[df['age'] >= 27]

  name  age  score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91

In [21]:
# score가 90 이상인 사람의 이름과 score만 출력하세요.
df.loc[df['score'] >= 90, ['name', 'score']]

  name  score
B  이영희     92
D  정수진     95
G  윤지원     91

In [22]:
# age가 25 이상이면서 score가 90 이상인 행을 모두 선택하세요.
df.loc[(df['age'] >= 25) & (df['score'] >= 90)]

  name  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [23]:
# 첫 번째 행의 모든 데이터를 선택하세요.
df.iloc[0]

name     김철수
age       25
score     85
Name: A, dtype: object

In [24]:
# 세 번째 행의 이름 값만 선택하세요.
df.iloc[2,0]

'박민수'

In [25]:
# 처음 3개의 행을 선택하세요.
df.iloc[0:3]

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [26]:
# 마지막 행의 score 값만 선택하세요.
df.iloc[-1, 2]

np.int64(91)

In [27]:
# 1번 행부터 4번 행까지 선택하세요.
df.iloc[1:5]

  name  age  score
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

In [28]:
# 2번 행부터 5번 행까지에서 이름과 age 열만 선택하세요.
df.iloc[1:6, [0, 1]]

  name  age
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [29]:
# 모든 행에서 age 열만 선택하세요.
df.iloc[ : , 1]

A    25
B    28
C    22
D    31
E    27
F    24
G    29
Name: age, dtype: int64

In [30]:
# score 열만 선택하되, 앞에서 4개의 행만 출력하세요.
df.iloc[0:4, 2]

A    85
B    92
C    78
D    95
Name: score, dtype: int64

In [31]:
# 이름과 score 열을 선택하되, 마지막 3개의 행만 출력하세요.
df.iloc[-3:, [0, 2]]

  name  score
E  최영호     88
F  한미래     73
G  윤지원     91

In [32]:
# 짝수 번째 행(0, 2, 4, 6)의 모든 데이터를 선택하세요.
df.iloc[::2]

  name  age  score
A  김철수   25     85
C  박민수   22     78
E  최영호   27     88
G  윤지원   29     91

In [33]:
# loc를 사용하여 새로운 행 추가
df.loc['H'] = ['장민호', 26, 88]

In [34]:
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
H  장민호   26     88

In [36]:
# 직접 할당으로 열 추가
df['grade'] = ['A', 'B', 'A', 'A', 'B', 'C', 'A','C']
df

  name  age  score grade
A  김철수   25     85     A
B  이영희   28     92     B
C  박민수   22     78     A
D  정수진   31     95     A
E  최영호   27     88     B
F  한미래   24     73     C
G  윤지원   29     91     A
H  장민호   26     88     C

In [39]:
# insert() 메서드로 특정 위치에 열 추가
df.insert(loc=1, column='student_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'])

ValueError: cannot insert student_id, already exists

In [40]:
df

  name student_id  age  score grade
A  김철수       S001   25     85     A
B  이영희       S002   28     92     B
C  박민수       S003   22     78     A
D  정수진       S004   31     95     A
E  최영호       S005   27     88     B
F  한미래       S006   24     73     C
G  윤지원       S007   29     91     A
H  장민호       S008   26     88     C

In [ ]:
# 인덱스로 행 삭제, inplace=True를 설정하면 원본 데이터프레임을 직접 수정할 수 있다.
df.drop('A', axis=0)  # 'A' 인덱스의 행 삭제

  name student_id  age  score grade
B  이영희       S002   28     92     B
C  박민수       S003   22     78     A
D  정수진       S004   31     95     A
E  최영호       S005   27     88     B
F  한미래       S006   24     73     C
G  윤지원       S007   29     91     A
H  장민호       S008   26     88     C

In [ ]:
# 여러 행 한 번에 삭제, inplace=True를 설정하면 원본 데이터프레임을 직접 수정할 수 있다.
df.drop(['B', 'C'], axis=0)

  name student_id  age  score grade
A  김철수       S001   25     85     A
D  정수진       S004   31     95     A
E  최영호       S005   27     88     B
F  한미래       S006   24     73     C
G  윤지원       S007   29     91     A
H  장민호       S008   26     88     C

In [44]:
# 열 이름으로 열 삭제
df.drop('grade', axis=1)  # 'grade' 열 삭제

  name student_id  age  score
A  김철수       S001   25     85
B  이영희       S002   28     92
C  박민수       S003   22     78
D  정수진       S004   31     95
E  최영호       S005   27     88
F  한미래       S006   24     73
G  윤지원       S007   29     91
H  장민호       S008   26     88

In [45]:
# 여러 열 한 번에 삭제
df.drop(['age', 'score'], axis=1)

  name student_id grade
A  김철수       S001     A
B  이영희       S002     B
C  박민수       S003     A
D  정수진       S004     A
E  최영호       S005     B
F  한미래       S006     C
G  윤지원       S007     A
H  장민호       S008     C